// Программа вводит переменные x,y,z в разных форматах записи, которые указаны в
// лабораторной работе и считает переменные a,b
// выполнил работу Тимофеев Михаил БПМ231
#include <stdio.h>
#include <math.h>
#include <stdlib.h>

int main() {
    int x, y;
    float z, a, b, c;
    printf("Лабораторная работа 1. Автор: Тимофеев Михаил.\n");
    printf("Введите целое значение переменной x:\n"); //сообщение в вводе переменной
    scanf("%d", &x); //ввод переменной х
    printf( "Введите целое значение переменной y:\n"); //сообщение в вводе переменной
    scanf("%d", &y); //ввод переменной y
    printf("Введите вещественное значение переменной z:\n"); //сообщение в вводе переменной
    scanf("%f", &z); //ввод переменной z
    a = pow(x, 3) - 
        4 * y / (5-sin(3 * sqrt(x))) *
            log(fabs(z + 2 * x) + 1); //подсчет переменной а по формуле
    b = pow(x, 3) / 6 -
        2 * sqrt(abs(3 * x)); //подсчет переменной b по формуле
    c = tanf(fabs((double)x/(double)y)); //подсчет переменной c (дополнительное задание)
    printf("\nx = %10d", x);
    printf("\ny = %10d", y);
    printf("\n z = %10.5e", z);
    printf("\n a = %10.4f", a);
    printf("\n b = %10.4f", b);
    printf("\n tan = %f", c);
    printf("\n x(8) = %10o", x);
    printf("\n y(16) = %10x", y); //вывод всех переменных в форматах, указанных в задании
    return 0;
}
